[
{
    "title_en": "Added guidance on considering both official languages when creating lists",
    "title_fr": "Ajout de directives sur la prise en considération des deux langues officielles lors de la création d'une liste",
    "description_en": "New guidelines have been added about considering both official languages to ensure a similar web experience.",
    "description_fr": "De nouvelles lignes directrices ont été ajoutées concernant la prise en considération des deux langues officielles pour assurer une expérience Web similaire.",
    "linkText_en": "Lists",
    "linkUrl_en": "../design-systems/gcweb/lists/index.html",
    "linkText_fr": "Listes",
    "linkUrl_fr": "../systemes-conception/gcweb/listes/index.html",
    "date_en": "November 5, 2024",
    "date_fr": "5 novembre 2024",
    "modified_en": "New",
    "modified_fr": "Nouveau",
    "keywords_en": "official languages, web experience, bilingual content, lists, word order",
    "keywords_fr": "langues officielles, expérience Web, contenu bilingue, listes, ordre des mots"
  },
  {
    "title_en": "Added guidance on considering both official languages when choosing headings and titles",
    "title_fr": "Ajout de directives sur la prise en considération des deux langues officielles lors de la création de titres et de sous-titres",
    "description_en": "New guidelines have been added about considering both official languages to ensure a similar web experience.",
    "description_fr": "De nouvelles lignes directrices ont été ajoutées concernant la prise en considération des deux langues officielles pour assurer une expérience Web similaire.",
    "linkText_en": "Headings and titles",
    "linkUrl_en": "../design-systems/gcweb/headings-titles/index.html",
    "linkText_fr": "Titres et sous-titres",
    "linkUrl_fr": "../systemes-conception/gcweb/titres-sous-titres/index.html",
    "date_en": "November 5, 2024",
    "date_fr": "5 novembre 2024",
    "modified_en": "New",
    "modified_fr": "Nouveau",
    "keywords_en": "official languages, web experience, bilingual content, headings, titles, word order",
    "keywords_fr": "langues officielles, expérience Web, contenu bilingue, titres, sous-titres, ordre des mots"
  },
{
    "title_en": "Published a new UCD blog article: “Designing in Canada's official languages”",
    "title_fr": "Publication d'un nouvel article de blogue sur la conception axée sur l'utilisateur : « Concevoir du contenu dans les langues officielles du Canada »",
    "description_en": "Learn about 6 stylistic trends specific to English and French that you should be aware of when preparing content that will be available in both languages.",
    "description_fr": "Découvrez six tendances stylistiques propres à l’anglais et au français que vous devriez connaître lorsque vous préparez le contenu qui sera disponible dans les deux langues.",
    "linkText_en": "Designing in Canada's Offical languages ",
    "linkUrl_en": "../blog/2024-09-designing-official-languages.html",
    "linkText_fr": "Concevoir du contenu dans les langues officielles du Canada",
    "linkUrl_fr": "../blogue/2024-09-concevoir-contenu-langues-officielles.html",
    "date_en": "October 17, 2024",
    "date_fr": "17 octobre 2024",
    "modified_en": "New",
    "modified_fr": "Nouveau",
    "keywords_en": "French, english, bilingual, bilingualism, translation, translating",
    "keywords_fr": "Français, anglais, bilingue, bilinguisme, traduction, traduction"
  },
  {
    "title_en": "Moved the contractions guidelines to the Short forms page",
    "title_fr": "Déplacement des lignes directrices sur les contractions à la page sur les formules abrégées",
    "description_en": "Guidance on contractions has been moved from the Punctuation page to the Short forms page. A recovery link is still available on the Punctuation page.",
    "description_fr": "Changements faits seulement sur la page en anglais. Les lignes directrices sur les contractions ont été déplacées de la page sur la ponctuation à la page sur les formules abrégées.",
    "linkText_en": "Contractions",
    "linkUrl_en": "../writing/short-forms.html#h_2",
    "linkText_fr": "Contractions (en anglais)",
    "linkUrl_fr": "../../en/writing/short-forms.html#h_2",
    "date_en": "July 9, 2024",
    "date_fr": "9 juillet 2024",
    "modified_en": "Updated",
    "modified_fr": "Mises à jour",
    "keywords_en": "contractions, punctuation, short forms, abbreviation, moved content, reorganized content",
    "keywords_fr": "contraction, ponctuation, formule abrégée, abréviation, contenu déplacé, réorganisation, contenu réorganisé"
  },
    {
    "title_en": "Reorganized the Short forms page content",
    "title_fr": "Réorganisation du contenu de la page sur les formules abrégées",
    "description_en": "The headings were revised and the content was reordered to improve clarity on the Short forms page.",
    "description_fr": "Changements faits seulement sur la page en anglais. Les titres ont été révisés et le contenu a été réorganisé afin d’améliorer la clarté de la page sur les formules abrégées.",
    "linkText_en": "Short forms",
    "linkUrl_en": "../writing/short-forms.html",
    "linkText_fr": "Short forms (en anglais)",
    "linkUrl_fr": "../../en/writing/short-forms.html",
    "date_en": "July 9, 2024",
    "date_fr": "9 juillet 2024",
    "modified_en": "Updated",
    "modified_fr": "Mises à jour",
    "keywords_en": "contractions, punctuation, short forms, abbreviation, moved content, reorganized content",
    "keywords_fr": "contraction, ponctuation, formule abrégée, abréviation, contenu déplacé, réorganisation, contenu réorganisé"
  },
  {
    "title_en": "Published the first UCD blog article: “Creating Accessible Web Content”",
    "title_fr": "Publication du premier article de blogue sur la conception axée sur l'utilisateur : « Créer un contenu Web accessible »",
    "description_en": "The first article in the User-Centred Design blog details how to improve the accessibility of your web content with these common structural and labeling best practices.",
    "description_fr": "Le premier article du blogue sur la conception axée sur l’utilisateur explique comment améliorer l’accessibilité de votre contenu Web grâce à ces pratiques exemplaires courantes en matière de structure et d’étiquettes.",
    "linkText_en": "Creating accessible web content",
    "linkUrl_en": "../blog/2024-05-accessible-content.html",
    "linkText_fr": "Créer un contenu Web accessible",
    "linkUrl_fr": "../blogue/2024-05-contenu-accessible.html",
    "date_en": "May 27, 2024",
    "date_fr": "27 mai 2024",
    "modified_en": "New",
    "modified_fr": "Nouveau",
    "keywords_en": "developers, Web Content Accessibility Guideline, WCAG",
    "keywords_fr": "développeurs, Web Content Accessibility Guideline, WCAG"
  },
  {
    "title_en": "Launched the User-Centred Design Blog",
    "title_fr": "Lancement du blogue sur la conception axée sur l’utilisateur",
    "description_en": "Articles about user-centred design at the CRA. Contributors to the blog come from all over the CRA. We added a link to the blog on our home page.",
    "description_fr": "Articles sur la conception axée sur l’utilisateur à l’ARC. Les collaborateurs du blogue proviennent de partout à l’ARC. Nous avons ajouté un lien vers le blogue sur notre page d’accueil.",
    "linkText_en": "Blog",
    "linkUrl_en": "../blog/index.html",
    "linkText_fr": "Blogue",
    "linkUrl_fr": "../blogue/index.html",
    "date_en": "May 27, 2024",
    "date_fr": "27 mai 2024",
    "modified_en": "New",
    "modified_fr": "Nouveau",
    "keywords_en": "post",
    "keywords_fr": "publication"
  },
  {
    "title_en": "Added guidance for redacted content and strikethrough text",
    "title_fr": "Ajout de directives sur le contenu caviardé et le texte barré",
    "description_en": "On the Text editing effects page, new guidance on how to display redacted content has been added, as well as additional information on how to use classes for strikethrough text.",
    "description_fr": "Sur la page des effets de modification du texte, de nouvelles lignes directrices sur la façon d’afficher le contenu caviardé ont été ajoutées, ainsi que des renseignements supplémentaires sur la façon d’utiliser les classes pour le texte barré.",
    "linkText_en": "Text editing effects",
    "linkUrl_en": "../design-systems/gcweb/text-editing-effects/index.html",
    "linkText_fr": "Effets de modification de texte",
    "linkUrl_fr": "../systemes-conception/gcweb/effets-de-modification-du-texte/index.html",
    "date_en": "April 30, 2024",
    "date_fr": "30 avril 2024",
    "modified_en": "Updated",
    "modified_fr": "Mises à jour",
    "keywords_en": "design-system, redaction",
    "keywords_fr": "système-de-conception, rédaction"
  },
  {
    "title_en": "Published new writing guidance section",
    "title_fr": "Publication d'une nouvelle section d'aide à la rédaction",
    "description_en": "A comprehensive source on how to write good, usable content. This updates and combines guidance from the Canada.ca Content Style Guide and the Writing Guide for the CRA. It also includes new guidance on a variety of topics like considering the needs of your audience.",
    "description_fr": "Une ressource complète sur la façon de rédiger un contenu de qualité et convivial. Elle met à jour et combine les lignes directrices du Guide de rédaction du contenu du site Canada.ca et du Guide sur la rédaction à l'ARC. Elle comprend également de nouvelles lignes directrices sur une variété de sujets tels que la prise en compte des besoins de votre public.",
    "linkText_en": "Writing",
    "linkUrl_en": "../writing/index.html",
    "linkText_fr": "Rédaction",
    "linkUrl_fr": "../redaction/index.html",
    "date_en": "September 15, 2023",
    "date_fr": "15 septembre 2023",
    "modified_en": "New",
    "modified_fr": "Nouveau",
    "keywords_en": "writing",
    "keywords_fr": "rédaction"
  },
  {
    "title_en": "Expanded and updated subway template guidance",
    "title_fr": "Élargissement et mise à jour des lignes directrices relatives au modèle de navigation de style métro",
    "description_en": "Guidance on using the subway template for task-based content on Canada.ca. Includes guidance on determing the architecture for your content, creating the index page and step pages, and when and how to create sub-pages. ",
    "description_fr": "Des lignes directrices sur l'utilisation du modèle de navigation de style métro pour le contenu axé sur les tâches sur Canada.ca. Comprend des lignes directrices pour choisir l'architecture de votre contenu, la création de la page d'index et des pages d'étape, ainsi que sur quand et comment créer des sous-pages. ",
    "linkText_en": "Subway",
    "linkUrl_en": "../design-systems/gcweb/subway/index.html",
    "linkText_fr": "Navigation de style métro",
    "linkUrl_fr": "../systemes-conception/gcweb/metro/index.html",
    "date_en": "September 15, 2023",
    "date_fr": "15 septembre 2023",
    "modified_en": "Updated",
    "modified_fr": "Mises à jour",
    "keywords_en": "design-system",
    "keywords_fr": "système-de-conception"
  },
  {
    "title_en": "Added links to design guidance for other channels ",
    "title_fr": "Ajout de liens vers des lignes directrices relatives à la conception pour d'autres canaux ",
    "description_en": "Design systems and guidance for the contact centre manuals, print, forms, multimedia, social media, correspondence and more can now be found in the design systems section.",
    "description_fr": "Des systèmes de conception et des lignes directrices pour les manuels du centre de contact, le contenu imprimé, les formulaires, le multimédia, les médias sociaux, la correspondance et plus encore se trouvent maintenant dans la section des systèmes de conception.",
    "linkText_en": "Design systems",
    "linkUrl_en": "../design-systems/index.html",
    "linkText_fr": "Systèmes de conception",
    "linkUrl_fr": "../systemes-conception/index.html",
    "date_en": "September 15, 2023",
    "date_fr": "15 septembre 2023",
    "modified_en": "New",
    "modified_fr": "Nouveau",
    "keywords_en": "design-system",
    "keywords_fr": "système-de-conception"
  },
  {
    "title_en": "Published new doormat guidance",
    "title_fr": "Publication de nouvelles lignes directrices sur les menus d'accueil thématiques",
    "description_en": "The links with descriptions that are found in our topic pages and other navigation pages are called doormats. Find out how to write doormats that help users find the best path to complete their task.",
    "description_fr": "Les liens accompagnés de descriptions que l'on trouve dans nos pages de sujets et autres pages de navigation se nomment les menus d'accueil thématiques. Découvrez comment rédiger des menus d'accueil thématiques qui aident les utilisateurs à trouver le meilleur chemin pour accomplir leur tâche.",
    "linkText_en": "Doormats",
    "linkUrl_en": "../design-systems/gcweb/doormats/index.html",
    "linkText_fr": "Menus d'accueil thématiques",
    "linkUrl_fr": "../systemes-conception/gcweb/liens-menu-accueil/index.html",
    "date_en": "June 22, 2023",
    "date_fr": "22 juin 2023",
    "modified_en": "New",
    "modified_fr": "Nouveau",
    "keywords_en": "design-system, writing",
    "keywords_fr": "système-de-conception, rédaction"
  },
  {
    "title_en": "Added context-specific features added to GC Web design system",
    "title_fr": "Ajout des promotions contextuelles dans le système de conception GCWeb",
    "description_en": "Context-specific features are in-page components used to promote government activities, initiatives, programs and services. We added a link to this pattern, which is part of the Canada.ca design system.",
    "description_fr": "Les promotions contextuelles sont des composantes d'intérieur de page servant à promouvoir des activités, des initiatives, des programmes et des services gouvernementaux. Nous avons ajouté un lien vers ce modèle, qui fait partie du système de conception de Canada.ca.",
    "linkText_en": "Context-specific features",
    "linkUrl_en": "https:\\/design.canada.ca/common-design-patterns/feature-tiles.html",
    "linkText_fr": "Promotions contextuelles",
    "linkUrl_fr": "https:\\/conception.canada.ca/configurations-conception-communes/vignettes-promotionnelles.html",
    "date_en": "June 20, 2023",
    "date_fr": "20 juin 2023",
    "modified_en": "New",
    "modified_fr": "Nouveau",
    "keywords_en": "design-system",
    "keywords_fr": "système-de-conception"
  },
  {
    "title_en": "Added campaign pages added to GC Web design system",
    "title_fr": "Ajout de pages de campagne dans le système de conception GCWeb ",
    "description_en": "Template for time-limited promotional pages designed to communicate, educate, influence, market, raise awareness and call to action. We added a link to this template, which is part of the Canada.ca design system.",
    "description_fr": "Un modèle pour les pages promotionnelles à durée limitée conçues pour communiquer, éduquer, influencer, commercialiser, sensibiliser et appeler à l'action. Nous avons ajouté un lien vers ce modèle, qui fait partie du système de conception de Canada.ca.",
    "linkText_en": "Campaign pages",
    "linkUrl_en": "https:\\/design.canada.ca/recommended-templates/campaign-pages.html",
    "linkText_fr": "Pages de campagne",
    "linkUrl_fr": "https:\\/conception.canada.ca/modeles-recommandes/pages-campagnes.html",
    "date_en": "June 17, 2023",
    "date_fr": "17 juin 2023",
    "modified_en": "New",
    "modified_fr": "Nouveau",
    "keywords_en": "design-system",
    "keywords_fr": "système-de-conception"
  },
  {
    "title_en": "Corrected code for contact us using interactive questions",
    "title_fr": "Correction du code pour nous contacter à l'aide de questions interactives",
    "description_en": "The working example for Contact us using interactive questions had some out of date code. We updated it to include the current version.",
    "description_fr": "L'exemple pratique pour les pages de contact utilisant des questions interactives contenait des codes obsolètes. Nous l'avons mis à jour pour inclure la version actuelle.",
    "linkText_en": "Contact us",
    "linkUrl_en": "../design-systems/gcweb/contact-us/index.html",
    "linkText_fr": "Contactez-nous",
    "linkUrl_fr": "../systemes-conception/gcweb/contactez-nous/index.html",
    "date_en": "June 12, 2023",
    "date_fr": "12 juin 2023",
    "modified_en": "Updated",
    "modified_fr": "Mises à jour",
    "keywords_en": "design-system",
    "keywords_fr": "système-de-conception"
  },
  {
    "title_en": "Improved guidance on stacked titles",
    "title_fr": "Amélioration des lignes directrices sur les titres superposés",
    "description_en": "Updated the Headings and titles page to clarify the differences in how stacked titles are used in the subway pattern versus in a topic.",
    "description_fr": "Mise à jour de la page sur les titres et les sous-titres pour clarifier les différences d'utilisation des titres superposés dans la navigation de style métro par rapport à une page de sujet.",
    "linkText_en": "Headings and titles",
    "linkUrl_en": "../design-systems/gcweb/headings-titles/index.html",
    "linkText_fr": "Titres et sous-titres",
    "linkUrl_fr": "../systemes-conception/gcweb/titres-sous-titres/index.html",
    "date_en": "June 12, 2023",
    "date_fr": "12 juin 2023",
    "modified_en": "Updated",
    "modified_fr": "Mises à jour",
    "keywords_en": "design-system, writing",
    "keywords_fr": "système-de-conception, rédaction"
  },
  {
    "title_en": "Added link writing and design guidance",
    "title_fr": "Ajout de lignes directrices sur la rédaction et la conception des liens",
    "description_en": "Published new guidance on links to help you create links that are effective and accessible.",
    "description_fr": "Publication de nouvelles lignes directrices sur les liens pour vous aider à créer des liens efficaces et accessibles.",
    "linkText_en": "Links",
    "linkUrl_en": "../design-systems/gcweb/links/index.html",
    "linkText_fr": "Liens",
    "linkUrl_fr": "../systemes-conception/gcweb/liens/index.html",
    "date_en": "May 15, 2023",
    "date_fr": "15 mai 2023",
    "modified_en": "New",
    "modified_fr": "Nouveau",
    "keywords_en": "design-system, writing",
    "keywords_fr": "système-de-conception, rédaction"
  },
  {
    "title_en": "New activities on creating and structuring content",
    "title_fr": "Nouvelles activités sur la création et la structuration du contenu",
    "description_en": "Published 3 new activities in the Design phase that will help you to build out the content, moving from information architecture to the layout to detailed writing.",
    "description_fr": "Publication de 3 nouvelles activités dans la phase Concevoir qui vous aideront à élaborer le contenu, en passant par l'architecture de l'information, la mise en page et la rédaction détaillée.",
    "linkText_en": "Design phase",
    "linkUrl_en": "../process/content-optimization/design.html",
    "linkText_fr": "Phase Concevoir",
    "linkUrl_fr": "../processus/optimisation-contenu/concevoir.html",
    "date_en": "March 13, 2023",
    "date_fr": "13 mars 2023",
    "modified_en": "New",
    "modified_fr": "Nouveau",
    "keywords_en": "process-activity",
    "keywords_fr": "processus-activités"
  },
  {
    "title_en": "Published headings and titles guidance",
    "title_fr": "Publication de lignes directrices sur les titres et les sous-titres",
    "description_en": "Added new guidance on writing good headings and titles, selecting the best page title and organizing content using headings.",
    "description_fr": "Ajout de nouvelles lignes directrices sur la rédaction de titres et sous-titres de qualité, la sélection du meilleur titre de page et l'organisation du contenu à l'aide d'en-têtes.",
    "linkText_en": "Headings and titles",
    "linkUrl_en": "../design-systems/gcweb/headings-titles/index.html",
    "linkText_fr": "Tites et sous-titres",
    "linkUrl_fr": "../systemes-conception/gcweb/titres-sous-titres/index.html",
    "date_en": "March 10, 2023",
    "date_fr": "10 mars 2023",
    "modified_en": "New",
    "modified_fr": "Nouveau",
    "keywords_en": "design-system, writing",
    "keywords_fr": "système-de-conception, rédaction"
  },
  {
    "title_en": "Improved titles and descriptions of design systems based on user research",
    "title_fr": "Amélioration des titres et des descriptions des systèmes de conception sur la base de la recherche auprès des utilisateurs",
    "description_en": "In research with users we found that the 3 different design systems were not labelled clearly enough. We updated the titles and descriptions of them to help users find the right design system",
    "description_fr": "Lors de nos recherches auprès des utilisateurs, nous avons constaté que le nom des 3 différents systèmes de conception n'étaient pas assez clairs. Nous avons mis à jour les titres et les descriptions de ces systèmes afin d'aider les utilisateurs à trouver le bon système de conception.",
    "linkText_en": "Design systems",
    "linkUrl_en": "../design-systems/index.html",
    "linkText_fr": "Systèmes de conception",
    "linkUrl_fr": "../systemes-conception/index.html",
    "date_en": "February 28, 2023",
    "date_fr": "28 février 2023",
    "modified_en": "Updated",
    "modified_fr": "Mises à jour",
    "keywords_en": "design-system",
    "keywords_fr": "système-de-conception"
  },
  {
    "title_en": "Added GC web design system overview",
    "title_fr": "Ajout de l'aperçu du système de conception GCWeb",
    "description_en": "Our GC web design system includes components, templates and design basics from the Canada.ca design system, the Web Experience Toolkit and CRA-specific elements.",
    "description_fr": "Notre système de conception GCWeb comprend des composantes, des modèles et des principes de base de la conception provenant du système de conception de Canada.ca, de la boîte à outils de l'expérience Web et d'éléments spécifiques à l'ARC.",
    "linkText_en": "GC Web design system overview",
    "linkUrl_en": "../design-systems/gcweb/gcweb-overview.html",
    "linkText_fr": "Aperçu du système de conception GCWeb",
    "linkUrl_fr": "../systemes-conception/gcweb/apercu-gcweb.html",
    "date_en": "January 25, 2023",
    "date_fr": "25 janvier 2023",
    "modified_en": "New",
    "modified_fr": "Nouveau",
    "keywords_en": "design-system",
    "keywords_fr": "système-de-conception"
  },
  {
    "title_en": "Updated the name of our community",
    "title_fr": "Mise à jour du nom de notre communauté",
    "description_en": "The name of our community of practice changed to the User-centred design community to better reflect the full scope of the work that we do. We updated the link on the home page to reflect the new name. Have you joined the community yet?",
    "description_fr": "Le nom de notre communauté de pratique a changé pour devenir la Communauté de conception axée sur l'utilisateur afin de mieux refléter toute la portée du travail que nous effectuons. Nous avons mis à jour le lien sur la page d'accueil pour refléter le nouveau nom. Avez-vous déjà rejoint la communauté?",
    "linkText_en": "Home",
    "linkUrl_en": "../index.html",
    "linkText_fr": "Page d'accueil",
    "linkUrl_fr": "../index.html",
    "date_en": "January 12, 2023",
    "date_fr": "12 janvier 2023",
    "modified_en": "Updated",
    "modified_fr": "Mises à jour",
    "keywords_en": "other",
    "keywords_fr": "autre"
  }
]
