[{"id":"02-12-57309","createdAt":"2025-12-02T14:00:11.197Z","answers":[{"questionId":341,"type":"textField","questionEn":"Case number","questionFr":"Numéro de dossier","answer":"257944"},{"questionId":161,"type":"dynamicRow","questionEn":"Periods under this PSBCR","questionFr":"Périodes sous cet EOEPSP","answer":[[{"questionId":16101,"type":"formattedDate","questionEn":"Tax year ending","questionFr":"Année d'imposition se terminant","answer":"2023-12-31"}]]},{"questionId":241,"type":"textField","questionEn":"First name of the CRA officer","questionFr":"Prénom de l'agent de l'ARC","answer":"David "},{"questionId":243,"type":"textField","questionEn":"Last name of the CRA officer","questionFr":"Nom de famille de l'agent de l'ARC","answer":"Pope"},{"questionId":441,"type":"radio","questionEn":"You are the responding to this questionnaire as:","questionFr":"Vous répondez à ce questionnaire en tant que: ","answer":"Worker whose corporation who provided services to a payer"},{"questionId":443,"type":"textField","questionEn":"Legal name of the business","questionFr":"Nom légal de l'entreprise","answer":"8537780 CANADA INC."},{"questionId":315,"type":"combobox","questionEn":"Sector","questionFr":"Secteur","answer":"Transportation and warehousing"},{"questionId":316,"type":"combobox","questionEn":"Subsector of transportation","questionFr":"Sous-secteur du transport","answer":"Truck transportation"},{"questionId":170,"type":"radio","questionEn":"Did the worker's corporation employ in the business 5 full-time employees or fewer throughout the year?","questionFr":"La société du travailleur employait-elle dans l'entreprise 5 employés à temps plein ou moins tout au long de l'année?","answer":"No - More than 5 full-time employees"},{"questionId":356,"type":"radio","questionEn":"Did the worker's corporation distribute all T4 slips to these employees for the period under review?","questionFr":"La société du travailleur a-t-elle distribué tous les feuillets T4 à ces employés pour la période visée par l'examen?","answer":"Yes"},{"questionId":464,"type":"radio","questionEn":"Where all T4 slips for these employees accurate for the period under review?","questionFr":"Tous les feuillets T4 de ces employés étaient-ils exacts pour la période visée par l’examen?","answer":"Yes"},{"questionId":245,"type":"radio","questionEn":"Did the worker's corporation (or a person related to the worker's corporation) at any time in the year directly or indirectly own at least 10% of the issued shares of the corporation? ","questionFr":"La société du travailleur (ou une personne liée à la société du travailleur) détenait-elle durant l'année, directement ou indirectement, au moins 10 % des actions émises de la société?","answer":"Yes"},{"questionId":352,"type":"radio","questionEn":"Was a completed Form T2SCH50, Shareholder Information sent with the T2 return? ","questionFr":"Un formulaire T2SCH50, Renseignements sur les actionnaires, dûment rempli a-t-il été envoyé avec la déclaration T2?","answer":"Yes"},{"questionId":465,"type":"radio","questionEn":"Was the Form T2SCH50 , Shareholder Information accurate for the period under review?","questionFr":"Le formulaire T2SCH50, Renseignements sur les actionnaires, était-il exact pour la période visée par l'examen?","answer":"Yes"},{"questionId":314,"type":"dynamicRow","questionEn":"You are required to provide the following information for each of the payers (clients) for which the worker's corporation provided their services","questionFr":"Vous devez fournir les renseignements suivants pour chacun des payeurs (clients) pour lesquels la société du travailleur a fourni ses services","answer":[[{"questionId":31401,"type":"formattedDate","questionEn":"Period of the contract - Start date","questionFr":"Durée du contrat - Date de début","answer":"2023-08-16"},{"questionId":31407,"type":"formattedDate","questionEn":"Period of the contract - End date (do not enter a date if the contract has not ended)","questionFr":"Durée du contrat - Date de fin (ne pas inscrire de date si le contrat n’est pas terminé)","answer":""},{"questionId":31402,"type":"textField","questionEn":"Legal business name of this payer","questionFr":"Nom légal de l'entreprise de ce payeur","answer":"autobahn freight lines ltd"},{"questionId":31403,"type":"textField","questionEn":"Business trading or operating name (if different from its legal name)","questionFr":"Nom commercial de l’entreprise (s’il est différent de son nom légal)","answer":""},{"questionId":31404,"type":"textField","questionEn":"Business number (BN) of this payer ","questionFr":"Numéro d'entreprise (NE) de ce payeur","answer":"866690027"},{"questionId":31405,"type":"textField","questionEn":"Describe the type of services the worker performed for this payer","questionFr":"Décrivez le type de services que le travailleur a fournis à ce payeur","answer":"owner-operator in the trucking/transportation industry"},{"questionId":31410,"type":"textField","questionEn":"Total amount of sales received from this payer during the fiscal year","questionFr":"Montant total de ventes reçues de ce payeur durant l’année d’imposition  ","answer":"196874"},{"questionId":31411,"type":"radio","questionEn":"Did the worker include this amount in their calculation of the total sales of the Schedule 125, Income Statement Information?","questionFr":"Le travailleur a-t-il inclus ce montant dans son calcul du total des ventes de l'annexe 125, Renseignements de l'état des résultats?","answer":"Yes"},{"questionId":31412,"type":"radio","questionEn":"Did the worker include this amount in their calculation of the total sales on line 101 of their GST/HST return?","questionFr":"Le travailleur a-t-il inclus ce montant dans son calcul du total des ventes à la ligne 101 de la déclaration de la TPS/TVH?","answer":"Not applicable - The worker is not registered for the GST/HST"},{"questionId":31406,"type":"radio","questionEn":"Did the worker receive a T4A, T5018 or T4A-NR slip from this payer for the services they provided?","questionFr":"Le travailleur a-t-il reçu un feuillet T4A, T5018 ou T4A-NR de ce payeur pour les services qu'il a fournis?","answer":"Yes"}]]},{"questionId":236,"type":"textArea","questionEn":"At the time of contracting, provide the details on how the worker and the payer intended to characterize the relationship","questionFr":"Au moment de la conclusion du contrat, veuillez fournir les détails sur la façon dont le travailleur et le payeur avait l'intention de qualifier la relation","answer":"8537780 Canada Inc. operates as an owner-operator in the trucking/transportation industry. The company owns a truck and has been in a long-term contract with Autobahn Freight Lines Inc. (referred to as the \"Broker\").  \n \nIn transportation industry, while the client may work with various customers, the nature of the business typically involves contracts with brokers like Autobahn, who collect payments from customers and then remit to the owner operators.  \n \nBrokers generally manage fleets ranging from 50 to 500 trucks and provide discounted rates for fuel, insurance, plates, and other expenses. These costs are resupplied to owner-operators, with the broker deducting them from the gross payments. Beyond these deductions, owner-operators run their businesses independently, managing profits and losses. This includes significant expenses such as truck/trailer repairs, truck payments, depreciation, lease payments, tolls, and more.  \n \nComparison with Uber Business Model  \nThis business model closely resembles that of Uber drivers in the taxi industry. Uber drivers own their vehicles and are responsible for expenses such as insurance, plates, fuel, depreciation, lease payments (if applicable), repairs, and tolls. While they serve various customers, Uber collects payments from those customers and pays the drivers after deducting platform fees. Similarly, owner operator works with multiple customers but receives payments solely from the broker, Autobahn Freight Lines Inc., after applicable deductions."},{"questionId":207,"type":"radio","questionEn":"Was the contract or agreement a written document?","questionFr":"Le contrat ou l'entente était-il un document écrit?","answer":"Yes - You must send a copy of the contract or agreement with this questionnaire"},{"questionId":206,"type":"radio","questionEn":"Did the payer require the worker to incorporate as a condition of being hired?","questionFr":"Le payeur a-t-il exigé que le travailleur s’incorpore comme condition d’embauche?","answer":"No"},{"questionId":379,"type":"textArea","questionEn":"Provide the details of why the worker decided to incorporate","questionFr":"Si vous répondez au nom du travailleur, veuillez fournir en détails les raisons pour lesquelles le travailleur a décidé de se constituer en société","answer":"cant be determined from just the contract"},{"questionId":347,"type":"radio","questionEn":"Did the worker fill out the incorporation paperwork and send all documents?","questionFr":"Le travailleur a-t-il rempli et envoyés tous les documents de constitution en société?","answer":"Yes"},{"questionId":348,"type":"radio","questionEn":"Was an accountant provided or referred by the payer?","questionFr":"Un comptable a-t-il été fourni ou recommandé par le payeur?","answer":"No"},{"questionId":382,"type":"radio","questionEn":"Who was responsible for paying the accountant responsible for the worker’s corporate tax filings and other tax obligations of the worker’s corporation?","questionFr":"Qui était responsable de payer le comptable chargé des déclarations de l’entreprise du travailleur et des autres obligations fiscales de cette entreprise?","answer":"Worker"},{"questionId":349,"type":"radio","questionEn":"Was a hiring package given when the worker signed the contract with the payer?","questionFr":"Un package d'embauche a-t-il été remis au travailleur lors de la signature du contrat avec le payeur?","answer":"No"},{"questionId":389,"type":"radio","questionEn":"Where was the contract formed?","questionFr":"Où le contrat a-t-il été conclu?","answer":"Contract formed in a province or territory other than Quebec"},{"questionId":192,"type":"radio","questionEn":"Did the worker have defined duties?","questionFr":"Le travailleur avait-il des tâches définies?","answer":"Yes"},{"questionId":383,"type":"radio","questionEn":"Who established the priorities and deadlines for the work?","questionFr":"Qui a établi les priorités et les échéances pour le travail?","answer":"Payer and worker"},{"questionId":424,"type":"textArea","questionEn":"Provide details on how both established the priorities and deadlines for the work","questionFr":"Veuillez fournir des détails sur la façon dont tous deux ont établi les priorités et les échéances du travail","answer":"varied"},{"questionId":258,"type":"radio","questionEn":"Could the payer assign or change the worker's duties at their discretion including nature and volume of workload?","questionFr":"Le payeur pouvait-il assigner ou modifier les tâches du travailleur à sa discrétion, y compris la nature et la quantité de la charge de travail?","answer":"No"},{"questionId":257,"type":"radio","questionEn":"Could there have been ramifications if the worker refused work from the payer?","questionFr":"Y aurait-il eu des conséquences si le travailleur avait refusé du travail pour le payeur?","answer":"Yes"},{"questionId":492,"type":"radio","questionEn":"Was the worker (truck driver) told what route(s) to take by the payer? ","questionFr":"Le travailleur (chauffeur de camion) a-t-il reçu des instructions de la part du payeur concernant l’itinéraire à suivre?","answer":"Yes"},{"questionId":479,"type":"radio","questionEn":"Whose name and/or logo appeared on the truck?","questionFr":"Quel nom et/ou logo apparaissait sur le camion?","answer":"Payer"},{"questionId":259,"type":"radio","questionEn":"Did the worker have set days and hours of work established by the payer?","questionFr":"Le travailleur avait-il des journées et des heures de travail fixes établies par le payeur?","answer":"No"},{"questionId":261,"type":"radio","questionEn":"If the worker's days and hours of work were flexible, were they subject to the approval of the payer?","questionFr":"Si les journées et heures de travail du travailleur étaient flexibles, étaient-elles assujettis à l'approbation du payeur?","answer":"Yes"},{"questionId":262,"type":"radio","questionEn":"Was the worker required to record their days and hours of work and provide these records to the payer (for example, by email, timesheets, timecards)?","questionFr":"Le travailleur était-il tenu de consigner ses jours et heures de travail (par exemple par courriel, feuilles de temps, cartes de pointage)?","answer":"Yes"},{"questionId":263,"type":"radio","questionEn":"Did the worker require the payer's permission to leave the work during the hours that the payer has established?","questionFr":"Le travailleur avait-il besoin de la permission du payeur pour quitter le travail pendant les heures que le payeur a établies?","answer":"No"},{"questionId":264,"type":"radio","questionEn":"If the worker was unable to work due to illness or family emergencies, was the worker required to notify the payer?","questionFr":"Si le travailleur était incapable de travailler en raison d'une maladie ou d'urgences familiales, le travailleur était-il tenu d'aviser le payeur?","answer":"Yes"},{"questionId":265,"type":"radio","questionEn":" If the worker wished to take time off, was the worker required to ask for the payer's approval?","questionFr":"Si le travailleur souhaitait prendre congé, le travailleur était-il tenu de demander l'approbation du payeur?","answer":"No"},{"questionId":191,"type":"radio","questionEn":"Was the worker regularly monitored or supervised by the payer?","questionFr":"Le travailleur était-il régulièrement surveillé ou supervisé par le payeur?","answer":"Yes"},{"questionId":267,"type":"radio","questionEn":"If the payer would have directed the worker to redo the work, would the worker have been compensated for the time to redo the work?","questionFr":"Si le payeur avait demandé au travailleur de refaire le travail, le travailleur aurait-il été rémunéré pour le temps consacré à refaire le travail?","answer":"Yes"},{"questionId":268,"type":"radio","questionEn":"Did the payer require the worker to take part in certain events (for example, meetings, conferences, exhibitions, trade fairs)?","questionFr":"Le payeur avait-il exigé que le travailleur participe à certains événements (par exemple, réunions, conférences, expositions, foires commerciales)?","answer":"Yes"},{"questionId":312,"type":"textArea","questionEn":"Provide the details of these events","questionFr":"Veuillez fournir les détails de ces évènements","answer":"monthly safety meetings"},{"questionId":513,"type":"radio","questionEn":"Could the worker (truck driver) have sought or accepted additional cargo from other shippers or brokers when their truck is not fully loaded with cargo of the payer?","questionFr":"Le travailleur (chauffeur de camion) pouvait-il chercher ou accepter du fret supplémentaire provenant d'autres expéditeurs ou courtiers lorsque son camion n'était pas entièrement chargé avec la marchandise du payeur?","answer":"No"},{"questionId":494,"type":"radio","questionEn":"Did the worker (truck driver) have the discretion to accept passengers without the consent of the payer? ","questionFr":"Le travailleur (chauffeur de camion) avait-il la liberté d’accepter des passagers sans le consentement du payeur?","answer":"No"},{"questionId":496,"type":"radio","questionEn":"Was the worker (truck driver) required to keep in contact with the payer during trips with the vehicle, either by calling in or through an on-board computer?","questionFr":"Le travailleur (chauffeur de camion) devait-il rester en contact avec le payeur pendant les trajets avec le véhicule, soit par téléphone, soit par un ordinateur de bord?","answer":"Yes"},{"questionId":497,"type":"radio","questionEn":"Were the worker (truck driver)'s movements tracked with a global positioning system (GPS) or an electronic logging device (ELD)?  ","questionFr":"Les déplacements du travailleur (chauffeur de camion) étaient-ils suivis à l’aide d’un système de positionnement global ou d’un dispositif de consignation électronique?","answer":"Yes"},{"questionId":499,"type":"radio","questionEn":"Is the driver required to explain any changes to a specified route? ","questionFr":"Le chauffeur est-il tenu d’expliquer tout changement apporté à l’itinéraire prévu?","answer":"No"},{"questionId":297,"type":"radio","questionEn":"Did the payer withhold CPP, QPP, EI, QPIP or income tax deductions from the worker’s pay?","questionFr":"Le payeur avait-il retenu des cotisations du RPC, du RRQ, de l'AE, du RQAP ou des retenues d'impôts sur le revenu de la paie du travailleur?","answer":"No"},{"questionId":298,"type":"radio","questionEn":"Did the payer issue the worker a pay stub when they were paid?","questionFr":"Le payeur a-t-il remis au travailleur un talon de paye lorsqu'il a été payé?","answer":"No"},{"questionId":299,"type":"radio","questionEn":"Did the payer issue the worker a T4 slip to report their earnings under the contract? ","questionFr":"Le payeur a-t-il remis au travailleur un feuillet T4 pour déclarer ses revenus dans le cadre du contrat?","answer":"No - T4A slip"},{"questionId":271,"type":"radio","questionEn":"Did the payer determine the frequency and method of the payment of the worker's remuneration?","questionFr":"Le payeur a-t-il déterminé la fréquence et le mode de paiement de la rémunération du travailleur?","answer":"Yes"},{"questionId":300,"type":"radio","questionEn":"On what schedule was the remuneration under the contract paid?","questionFr":"Selon quel échéancier la rémunération prévue au contrat a-t-elle été versée?","answer":"Other"},{"questionId":385,"type":"textArea","questionEn":"Provide the details of the schedule of payment","questionFr":"Veuillez fournir les détails de l'échéancier de paiement","answer":"paid per mile ( as tracked by PC miller-30. also given fuel discount, and bonus if over certain weight"},{"questionId":301,"type":"radio","questionEn":"Was the worker entitled to overtime pay?","questionFr":"Le travailleur avait-il droit à une rémunération des heures supplémentaires?","answer":"No"},{"questionId":270,"type":"radio","questionEn":"Was the worker paid regardless of the volume of work performed?","questionFr":"Le payeur était-il payé quel que soit de la quantité de travail effectué?","answer":"Yes"},{"questionId":302,"type":"radio","questionEn":" In addition to remuneration, did the worker receive vacation pay, statutory holiday pay or payments during a sick leave?","questionFr":"En plus de la rémunération, le travailleur a-t-il reçu une paie de vacances, les jours fériés payés ou des paiements lors d'un congé de maladie?","answer":"No"},{"questionId":303,"type":"radio","questionEn":"Were there any employee benefits included in the compensation package offered to the worker?","questionFr":"Des avantages sociaux ont-ils été inclut dans la rémunération offerte au travailleur?","answer":"No"},{"questionId":304,"type":"radio","questionEn":"Did the worker participate in the payer’s private pension plan?","questionFr":"Le travailleur a-t-il participé dans le régime privé de pension du payeur?","answer":"No"},{"questionId":306,"type":"radio","questionEn":"How did the worker request payment for their services under the contract? ","questionFr":"Comment le travailleur a-t-il demandé le paiement de ses services dans le cadre du contrat?","answer":"Sending an invoice"},{"questionId":195,"type":"radio","questionEn":"Where did the worker primarily perform the services under the contract?","questionFr":" Où le travailleur a-t-il principalement effectué les services prévus au contrat?","answer":"Mobile locations"},{"questionId":296,"type":"radio","questionEn":"Who determined where the worker performed the services under the contract?","questionFr":"Qui avait déterminé le lieu où le travailleur a exécuté les services prévus au contrat?","answer":"Payer"},{"questionId":480,"type":"radio","questionEn":"Who decided where the truck used by the worker (truck driver) would be parked? ","questionFr":"Qui décidait où le camion utilisé par le travailleur (chauffeur de camion) devait être stationné?","answer":"Does not apply"},{"questionId":274,"type":"radio","questionEn":"Could the payer exercise disciplinary actions against the worker?","questionFr":"Le payeur pouvait-il exercer des actions disciplinaires à l’encontre du travailleur?","answer":"No"},{"questionId":275,"type":"radio","questionEn":"Did the payer have a right to dismiss the worker with or without cause and notice?","questionFr":"Le payeur avait-il droit de licencier le travailleur avec ou sans motif et préavis?","answer":"Yes - With or without cause"},{"questionId":428,"type":"radio","questionEn":"Did the payer have to pay compensation for dismissal without cause and notice? ","questionFr":"Le payeur a-t-il dû payer des indemnités pour un licenciement sans motif ni préavis?","answer":"No"},{"questionId":276,"type":"radio","questionEn":"Was the worker restricted from looking for work with other payers?","questionFr":"Le travailleur pouvait-il chercher du travail auprès de d'autres payeurs?","answer":"Yes"},{"questionId":388,"type":"textArea","questionEn":"Provide details on how the worker was restricted from working for other payers ","questionFr":"Veuillez fournir des détails sur la manière dont le travailleur a été restreint de travailler pour d'autres payeurs","answer":"Autobahn has exclusive possession and control of the equipment while it’s in service.\n\nYou must keep Autobahn’s identification on your truck and remove it only after termination."},{"questionId":429,"type":"radio","questionEn":"Did other workers perform the same type of work as the worker for the payer?","questionFr":"D'autres travailleurs avait-ils effectué le même type de travail que le travailleur pour le payeur?","answer":"Yes"},{"questionId":481,"type":"radio","questionEn":"Could the worker (truck driver) have used the truck to perform jobs for other payers without the payer's approval?","questionFr":"Le travailleur (chauffeur de camion) pouvait-il utiliser le camion pour effectuer des livraisons pour d'autres payeurs sans l'approbation du payeur ?","answer":"No"},{"questionId":278,"type":"radio","questionEn":"Where their schedule was irregular, did the payer have first call or priority on the worker's time?","questionFr":"Lorsque son horaire était irrégulier, le payeur a-t-il eu priorité sur le temps du travailleur?","answer":"Yes"},{"questionId":280,"type":"radio","questionEn":"Was the worker required to follow specific instructions or methods provided by the payer to complete the tasks?","questionFr":"Le travailleur était-il tenu de suivre des instructions ou des méthodes spécifiques fournies par le payeur pour accomplir les tâches?","answer":"Yes"},{"questionId":309,"type":"radio","questionEn":"Did the payer set standards and objectives to be met by the worker?","questionFr":"Le payeur a-t-il fixé des normes et des objectifs à atteindre par le travailleur?","answer":"Yes"},{"questionId":310,"type":"checkbox","questionEn":"What did the standards and objectives relate to?","questionFr":"Sur quoi portaient les normes et les objectifs?","answer":"Quality of work,Quantity of work,Length of time required to complete the task"},{"questionId":459,"type":"radio","questionEn":"Was the worker required to obtain the payer's approval before delegating or subcontracting the work?","questionFr":"Le travailleur était-il tenu d’obtenir l’approbation du payeur avant de déléguer ou de sous-traiter le travail?","answer":"Yes"},{"questionId":484,"type":"radio","questionEn":"Could the worker (truck driver) have hired someone else to drive the truck to provide the contracted services for the payer without the payer's approval? ","questionFr":"Le travailleur (chauffeur de camion) pouvait-il engager quelqu’un d’autre pour conduire le camion et fournir les services prévus au contrat pour le payeur, sans l’approbation de ce dernier?","answer":"No"},{"questionId":485,"type":"radio","questionEn":"Who paid the helpers (if any) that loaded or unloaded the truck?","questionFr":"Qui a payé les aides (le cas échéant) qui ont chargé ou déchargé le camion?","answer":"Worker"},{"questionId":198,"type":"radio","questionEn":"Did the payer provide the worker with training?","questionFr":"Le payeur a-t-il fourni une formation au travailleur?","answer":"No"},{"questionId":290,"type":"radio","questionEn":"Were the tools and equipment needed to perform the work provided by the payer?","questionFr":"Les outils et l’équipement nécessaires à l’exécution du travail ont-ils été fournis par le payeur?","answer":"No"},{"questionId":208,"type":"radio","questionEn":"Who owned the most important tools that the worker used while performing services for the payer?","questionFr":"À qui appartenait les outils les plus importants utilisés par le travailleur lorsqu'il effectuait des services pour le payeur?","answer":"Worker"},{"questionId":210,"type":"textArea","questionEn":"Provide the types of equipment, tools or materials","questionFr":"Veuillez fournir les types d'équipement, d'outils ou de matériaux","answer":"truck owned by worker, but leased to payer, with payers logos on truck"},{"questionId":284,"type":"radio","questionEn":"Did the worker use the payer's tools and equipment at no cost?","questionFr":"Le travailleur a-t-il utilisé gratuitement les outils et l’équipement du payeur?","answer":"Does not apply"},{"questionId":285,"type":"radio","questionEn":"Was the payer responsible for providing the required tools and equipment for the work?","questionFr":"Le payeur était-il responsable de fournir les outils et l’équipement nécessaires au travail?","answer":"No"},{"questionId":286,"type":"radio","questionEn":"Who was responsible for the repair, replacement, maintenance and insurance of the tools and equipment?","questionFr":"Qui était responsable de la réparation, du remplacement, de l'entretien et de l'assurance des outils et de l'équipement?","answer":"Worker"},{"questionId":471,"type":"radio","questionEn":"Who owned or leased the truck being driven by the worker (truck driver) at the request of the payer?","questionFr":"Qui était propriétaire ou locataire du camion conduit par le travailleur (chauffeur de camion) à la demande du payeur? ","answer":"Owned by the worker"},{"questionId":473,"type":"radio","questionEn":"Who was responsible for the cost of fuel and oil for the truck? ","questionFr":"Qui était responsable du coût du carburant et de l’huile pour le camion?","answer":"Worker"},{"questionId":474,"type":"radio","questionEn":"Who decided when and where repairs and maintenance for the truck would be done? ","questionFr":"Qui décidait quand et où les réparations et l’entretien du camion devaient être effectués?","answer":"Payer"},{"questionId":475,"type":"radio","questionEn":"Who paid for repairs to the truck?","questionFr":"Qui payait les réparations du camion?","answer":"Worker"},{"questionId":476,"type":"radio","questionEn":"If the worker (truck driver) paid for the repairs, was the truck driver reimbursed by the payer? ","questionFr":"Si le travailleur (chauffeur de camion) a payé les réparations, a-t-il été remboursé par le payeur?","answer":"No"},{"questionId":477,"type":"radio","questionEn":"Who provided any equipment required for securing the loads being transported, such as tarps, chains, straps, and binders? ","questionFr":"Qui fournissait l’équipement nécessaire pour sécuriser les charges transportées, comme les bâches, les chaînes, les sangles et les tendeurs ?","answer":"Payer"},{"questionId":430,"type":"radio","questionEn":"Was the worker entitled to any reimbursement from the payer of expenses incurred to perform the services under the contract? ","questionFr":"Le travailleur a-t-il eu droit à un remboursement de la part du payeur des dépenses encourues pour la prestation des services dans le cadre du contrat?","answer":"No"},{"questionId":211,"type":"radio","questionEn":"Did the payer assume responsibility for credit risk, bad debts, or terms of payment granted to buyers?","questionFr":"Le payeur a-t-il assumé la responsabilité du risque de crédit, des créances irrécouvrables ou des conditions de paiement accordées aux acheteurs?","answer":"No"},{"questionId":214,"type":"radio","questionEn":"Did the payer cover any guarantees related to materials or labour?","questionFr":"Le payeur a-t-il couvert des garanties liées aux matériaux ou à la main-d’œuvre?","answer":"No"},{"questionId":216,"type":"radio","questionEn":"Did the payer cover all work-related expenses (for example: repair costs, insurance premiums, costs for transportation of equipment, operating costs, rentals, office expenses)?","questionFr":"Le payeur a-t-il couvert toutes les dépenses liées au travail (par exemple : frais de réparation, primes d’assurance, frais de transport de l’équipement, coûts d’exploitation, locations, frais de bureau)?","answer":"No"},{"questionId":219,"type":"radio","questionEn":"Was the worker required to pay union dues?","questionFr":"Le travailleur était-il tenu payer des cotisations syndicales?","answer":"No"},{"questionId":233,"type":"radio","questionEn":"Did the payer provide support services (for example: secretarial, receptionist or credit services)?","questionFr":"Le payeur a-t-il fourni des services de soutien (par exemple : services de secrétariat, de réception ou de crédit)?","answer":"No"},{"questionId":495,"type":"radio","questionEn":"Was the worker (truck driver) required to maintain records such as fuel receipts, time sheets and mileage reports, other than the daily driving activities logbook? ","questionFr":"Le travailleur (chauffeur de camion) devait-il tenir des registres tels que les reçus de carburant, les feuilles de temps et les rapports de kilométrage, en plus du carnet de bord des activités de conduite quotidiennes?","answer":"No"},{"questionId":478,"type":"radio","questionEn":"Who was responsible for paying for the insurance? ","questionFr":"Qui était responsable du paiement de l’assurance?","answer":"Worker's corporation"},{"questionId":486,"type":"radio","questionEn":"Who paid for the liability insurance coverage? ","questionFr":"Qui payait la couverture d’assurance responsabilité civile?","answer":"Worker"},{"questionId":487,"type":"radio","questionEn":"If the worker (truck driver) had an accident or damaged the load being delivered, who would have been responsible for paying the damages? ","questionFr":"Si le travailleur (chauffeur de camion) avait eu un accident ou endommagé la cargaison livrée, qui aurait été responsable du paiement des dommages?","answer":"Worker"},{"questionId":360,"type":"checkbox","questionEn":"By providing this certification, you confirm that:","questionFr":"En fournissant cette certification, vous confirmez que :","answer":"All information provided in this questionnaire is true, accurate, and complete to the best of your knowledge,Your responses reflect the actual working relationship between the worker (payee) and the payer (client),You understand that the information will be used to determine whether the worker's corporation was carrying on a PSB under the Income Tax Act"},{"questionId":376,"type":"radio","questionEn":"You are the:  ","questionFr":"Vous êtes : ","answer":"Authorized representative"},{"questionId":364,"type":"textField","questionEn":"Your first name","questionFr":"Votre prénom","answer":"david "},{"questionId":366,"type":"textField","questionEn":"Your last name","questionFr":"Votre nom de famille","answer":"x"},{"questionId":373,"type":"textField","questionEn":"Your phone number","questionFr":"Votre numéro de téléphone","answer":"1231231234"},{"questionId":375,"type":"radio","questionEn":"Preferred language for communication","questionFr":"Langue de communication préférée","answer":"English"}]}]
